src/test/java/DataFiles/ProviderProfile_GlobalsTrue_SureScripts.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns="urn:lnrisk:ws:wshealthcare:@ver=2.41">
    <soap:Body>
        <ProviderReportRequest>
            <User>
                <EndUser/>
            </User>
            <HealthcareConfig/>
            <Options>
                <ReturnCount>25</ReturnCount>
                <IncludeEmail>0</IncludeEmail>
                <IncludeLanguages>0</IncludeLanguages>
                <IncludeCoveredRecipients>0</IncludeCoveredRecipients>
                <IncludeShaID>0</IncludeShaID>
                <IncludeSurescripts>1</IncludeSurescripts>
                <IncludeTaxID>0</IncludeTaxID>
                <IncludeIncomplete>0</IncludeIncomplete>
                <IncludeSanctions>0</IncludeSanctions>
                <IncludeSpecialties>0</IncludeSpecialties>
                <IncludeLicenses>0</IncludeLicenses>
                <IncludeDOB>0</IncludeDOB>
                <IncludeDOD>0</IncludeDOD>
                <IncludeDEA>0</IncludeDEA>
                <IncludeNPI>0</IncludeNPI>
                <IncludeUPIN>0</IncludeUPIN>
                <IncludeMedSchool>0</IncludeMedSchool>
                <IncludeMedicaid>0</IncludeMedicaid>
                <IncludeCSR>0</IncludeCSR>
                <IncludeAffiliations>0</IncludeAffiliations>
                <IncludeABMSBoardCertifiedSpecialty>0</IncludeABMSBoardCertifiedSpecialty>
                <IncludeVerifiedSecureFax>0</IncludeVerifiedSecureFax>
                <SuppressLicenseHistory>0</SuppressLicenseHistory>
                <SortAndRankLicenseTogether>0</SortAndRankLicenseTogether>
                <ExcludeGSASanction>0</ExcludeGSASanction>
                <IncludeMedicareEnrollment>0</IncludeMedicareEnrollment>
                <IncludeMedicareOrderReferring>0</IncludeMedicareOrderReferring>
            </Options>
            <ReportBy>
                <LNPID>58846</LNPID>
                <ProviderName/>
                <LocationAddress/>
                <DOB/>
                <MedSchool/>
                <ServiceFrom/>
                <ServiceTo/>
            </ReportBy>
            <AccountContext>
                <Common>
                    <Usage/>
                </Common>
            </AccountContext>
        </ProviderReportRequest>
    </soap:Body>
</soap:Envelope>